SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( MES-60507-A
	Type ( Engine )
	WagonShape ( DR_BR_A2-1_60507.s )
	
	Size  ( 2.82838m 4.08795m 13.811794m )
	CentreOfGravity ( 0.0m 0.0m 0.0m )
	Centre ( 0.0223335m 1.98309m -0.0772424m )
	Mass ( 98t-uk )
	Coupling (
		Type ( Bar )
		Spring (
			Stiffness ( 1e7N/m 1e7N/m )
			Damping ( 0.2e7N/m 0.2e7N/m )
			Break ( 1e9N 1e9N )
			r0 ( 10cm 1e9 )
		)
		CouplingHasRigidConnection (1)
		Velocity (0.1m/s)
	)
	
	Coupling (
			Type ( Chain )
			Spring (
			Stiffness ( 1e6N/m 2e6N/m )
			Damping ( 1e6N/m 1e6N/m )
			Break ( 1e9N 1e9N )
			r0 ( 20cm 40cm )
			)
	CouplingHasRigidConnection (1)
	Velocity (-0.1m/s)
	)
	
	Inside (
      PassengerCabinFile ( DR_BR_A2-1_60507.s )
      PassengerCabinHeadPos ( 1.5 3.0 -6.2 )
      RotationLimit ( 90 180 0 )
      StartDirection ( 0 20 0 )
  	)

Comment ( *** Friction *** )
	ORTSBearingType ( Friction )

Comment (Area: 115ft2, Report Based )
  ORTSDavis_A ( 6835 )
  ORTSDavis_B ( 40.8 )
  ORTSDavis_C ( 7.31 )

Comment ( *** Curve Resistance and SuperElevation *** )  
  CentreOfGravity ( 0m 2m 0m )
  ORTSTrackGauge ( 4ft 8.5in )
  ORTSUnbalancedSuperelevation ( 6in )
  ORTSRigidWheelbase ( 13.0ft 0.0in )
    
	BrakeEquipmentType ( "Vacuum_brake, Handbrake" )
	BrakeSystemType ( "Vacuum_single_pipe" )
	MaxBrakeForce ( 146kN )comment(ctn calc)
	MaxHandbrakeForce ( 0kN )comment(ctn calc)
	BrakeCylinderPressureForMaxBrakeBrakeForce ( 21 )        

Sound (	"..\\..\\Common.Steam\\A3Sound\\A3eng.sms" )

Lights	( 2
		Light	(
			comment( Position B White )
			Type ( 0 )
			Conditions (
			Headlight ( 4 ) Unit( 2 )
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
			State	(
			Duration ( 0.05 )
			LightColour ( ffffffff )
			Position ( 1.0 1.53 6.46 )
			Azimuth ( 0.0 -5.0 5.0 )
			Transition ( 0 )
			Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Position D White )
			Type ( 0 )
			Conditions (
			Headlight ( 4 ) Unit ( 2 )
			)
			Cycle ( 0 )
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			States ( 1
			State	(
			Duration ( 0.05 )
			LightColour ( ffffffff )
			Position ( -1.0 1.53 6.46 )
			Azimuth ( 0.0 -5.0 5.0 )
			Transition ( 0 )
			Radius ( 0.55 )
					)
				)
			)
		)
	)
	   
Engine ( MES-60507-A
Effects
	(
		SteamSpecialEffects
		(
			comment
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			WhistleFX
			(
				0.3 4.0 -4.4
				0 1 0
				0.15
			)

			SafetyValvesFX
			(
				0 4.3 -4.6
				0 1 0
				0.2
			)
			SafetyValvesFX
			(
				0 4.3 -4.9
				0 1 0
				0.3
			)
			StackFX
			(
				0 4.2 4.309
				0 1 0
				0.25
			)
			Injectors2FX
			(
				-1.5 0.9 -6.2
				-1 1 0
				0.16
			)
			Injectors1FX
			(
				1.5 0.9 -6.2
				1 1 0
				0.16
			)

			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)

			CylindersFX
			(
				-1.046 0.547 3.991
				0 0 1
				0.16
			)

			CylindersFX
			(
				1.046 0.547 3.991
				0 0 1
				0.16
			)
		)
	)

Wagon ( MES-60507-A )
Comment ( *** General *** )
		ORTSSteamLocomotiveType ( Simple )
		Type ( Steam )
		WheelRadius ( 37in )
		NumWheels ( 3 )
		ORTSDriveWheelWeight ( 66t-uk  )  
		    
Comment ( *** Cylinders *** )
    NumCylinders ( 3 )
    CylinderStroke ( 26in ) 
    CylinderDiameter ( 19in ) 

Comment ( *** Boiler *** )
    ORTSSteamBoilerType ( Superheated )
	  BoilerVolume ( "388*(ft^3)" ) Comment(Evap/8)
    ORTSEvaporationArea ( "2431*(ft^2)" )
    ORTSSuperheatArea ( "680*(ft^2)" )
    MaxBoilerPressure ( 225psi )
    	MaxSteamHeatingPressure ( 80psi )

ORTSMaxSuperheatTemperature(320.0)
ORTSMaxIndicatedHorsepower ( 2420.0hp )
ORTSBoilerEvaporationRate ( 16.7 )
ORTSBoilerEfficiency( 0.0 0.92  195.0 0.46 )
ORTSSuperheatCutoffPressureFactor ( 70.0 )
ORTSCylinderInitialPressureDrop ( 0.0 0.98 350 0.92 )
ORTSCylinderBackPressure( 0.0 0.0 2000.0 10.0 )



comment(ORTSBoilerEfficiency( 20.0 0.934 40.0 0.867 60.0 0.8 80.0 0.734 100.0 0.667 120.0 0.6 140.00 0.534 160.0 0.467 ))

Comment ( *** Fire *** ) 
    ORTSFuelCalorific ( 13700btu/lb )
    ORTSGrateArea ( "41.25*(ft^2)" )
    SteamFiremanMaxPossibleFiringRate( 3000 ) 
    ShovelCoalMass ( 14lb )
 Comment(   ORTSBurnRate( 0.0 100.0   9000.0 1000.0   17500.0 2000.0  24000.0 3000.0   29000.0  4000.0  33000.0 5000.0 ))

Comment ( *** Fuel *** )
    MaxTenderCoalMass ( 20160lb )
    MaxTenderWaterMass ( 50000lb )
    
Comment ( == Brake valve == )   
	TrainBrakesControllerMinSystemPressure( 0 )
	TrainBrakesControllerMaxSystemPressure( 21 )
 	BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
 	BrakeSystemType ( "Vacuum_single_pipe" )
    ORTSBrakePipeChargingRate ( 0.55 )
    ORTSBrakeServiceTimeFactor ( 20 )
    ORTSBrakePipeTimeFactor ( 0.0030 )
    comment(ORTSBrakePipeDischargeTimeFactor ( 0.2 ))
    comment(TrainPipeLeakRate ( 0.04 ))

	cabview ( TornadoA2.cvf )
	HeadOut (  -1.5 3.0 -6.2 )

EngineControllers (
            comment( Engine controls )
        
	Regulator ( 0 1 0.0475 0 
                NumNotches( 0 )
            )
            
	Cutoff    ( -0.75 0.75 0.02 0 
                NumNotches( 0 )
  		)

     Brake_Train ( 0 1 0.0475 0.65
            NumNotches( 3
            Notch( 0   1 TrainBrakesControllerReleaseStart )
            Notch(0.01 1 TrainBrakesControllerRunningStart )
            Notch(0.2  1 TrainBrakesControllerApplyStart )
                )
            )
            Brake_Hand ( 0 1 0.0125 0 
                NumNotches( 0 )
            )
            FireDoor ( 4 4 0.4 0 
                NumNotches( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2 
                NumNotches( 0 )
            )
            HeatingTap ( 0 1 0.025 0 
                NumNotches( 0 )
            )
            Shovel ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            DampersFront ( 0 1 0.1 1 
                NumNotches( 0 )
            )
            DampersBack ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Injector2Water ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            Bell ( 0 1 0 )
		 BellToggle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights ( 0 1 0 )
        )

	Sound (	"..\\..\\Common.Steam\\A3Sound\\A3cab.sms" )
    	Name ( "MES-60507-A A2-1, TE 36.4klbf" )
 	Description (
 	"Rather than rebuilding pre-existing locomotives, Thompson ordered the last four V2's to be built to the A2/1 design. These were built at Darlington, unlike the V2's which were all built at Doncaster. Construction of the A2/1s occurred during 1944 and was completed by January 1945. Compared to the V2's, the A2/1s had a number of innovations. The firebox had a rocking grate and hopper ashpan, which greatly simplified the process of dropping the fire and emptying the ash from the grate. Thompson also introduced an axle-driven alternator and electric lighting on the A2/1, which he later used on some of his other locomotive designs."
	)

	EngineOperatingProcedures (
	"To move forward\n"+
	"1.	Press the W key several times to move the Reverser to full Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the D key to increase the Regulator setting.\n"+  
	"4.	As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the Regulator to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
	"2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
	"2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+ 
	"2.	Press the S key several times to move the Reverser to the full Reverse position.\n"+
	"4.	Press the ; (SEMICOLON) key to release the brakes.\n"+
	"5.	Slowly advance the regulator (D key).\n\n"+
	"To load and unload passengers\n"+
	"1. Stop at a station.\n"+
	"2. Press the ENTER key.\n"+
	"3. Wait for the \"permission to depart\" whistle.\n"+
	"TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window.\n\n"+
	"Firing commands (Automatic Fireman OFF in Options screen)\n"+
	"To add coal to the firebox\n"+
	"1. Press the F key to open the Firebox door.\n"+
	"2. Press the R key to increase the shoveling rate.\n\n"+
	"To stop adding coal to the fire\n"+
	"1. Press SHIFT+R to decrease the shoveling rate.\n"+
	"2. Press SHIFT+F to close the firebox door.\n\n"+
	"To operate the blower\n"+
	"1.	Press the N key to increase the blower.\n"+
	"2. Press SHIFT+N to decrease the blower.\n\n"+
	"To operate the dampers\n"+
	"1.	Press the M key to open the dampers.\n"+
	"2. Press SHIFT+M to close the dampers.\n\n"+
	"To inject water into the boiler\n"+
	"1.	Press the I key to turn on the steam to Injector 1.\n"+
	"(You can also press the O key to turn on the steam to Injector 2.)\n"+
	"2.	Press the K key to increase the water flow to Injector 1.\n"+
	"(To increase the water flow to Injector 2, press the L key.)\n\n"+
	"To stop boiler water injection\n"+ 
	"1. Press the I key to turn off the steam to Injector 1.\n"+
	"2. Press the O key to turn off the steam to Injector 2."
	)
)
